System Bootstrap, Version 12.1(3r)T2, RELEASE SOFTWARE (fc1)
Copyright (c) 2000 by cisco Systems, Inc.
cisco 2811 (MPC860) processor (revision 0x200) with 60416K/5120K bytes of memory

Readonly ROMMON initialized

program load complete, entry point: 0x8000f000, size: 0xc940
program load complete, entry point: 0x8000f000, size: 0xc940

program load complete, entry point: 0x8000f000, size: 0x3ed1338
Self decompressing the image :
########################################################################## [OK]
              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 2800 Software (C2800NM-ADVIPSERVICESK9-M), Version 12.4(15)T1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 18-Jul-07 06:21 by pt_rel_team
Image text-base: 0x400A925C, data-base: 0x4372CE20

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.
cisco 2811 (MPC860) processor (revision 0x200) with 60416K/5120K bytes of memory
Processor board ID JAD05190MTZ (4292891495)
M860 processor: part number 0, mask 49
2 FastEthernet/IEEE 802.3 interface(s)
239K bytes of non-volatile configuration memory.
62720K bytes of  ATA CompactFlash (Read/Write)
Cisco IOS Software, 2800 Software (C2800NM-ADVIPSERVICESK9-M), Version 12.4(15)T1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 18-Jul-07 06:21 by pt_rel_team


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: no


Press RETURN to get started!



Router>enable
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inte
Router(config)#interface fast
Router(config)#interface fastEthernet 0/0
Router(config-if)#ip add
Router(config-if)#ip address 10.1.12.1 255.255.255.0
Router(config-if)#exit
Router(config)#ip address 10.1.12.1 255.255.255.0
                   ^
% Invalid input detected at '^' marker.
	
Router(config)#interface fastEthernet 0/0
Router(config-if)#no sh
Router(config-if)#no shutdown 

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#in
Router(config)#interface loopback 0

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 
Router(config-if)#ip address 10.1.0.1 255.255.255.0
Router(config-if)#exit
Router(config)#int
Router(config)#interface loo
Router(config)#interface loopback 1

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback1, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 10.1.1.1 255.255.255.0
Router(config-if)#exit
Router(config)#inter
Router(config)#interface loo
Router(config)#interface loopback 2

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback2, changed state to up

Router(config-if)#ip add
Router(config-if)#ip address 10.1.2.1 255.255.255.0
Router(config-if)#exit
Router(config)#inte
Router(config)#interface loo
Router(config)#interface loopback 3

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback3, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback3, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 10.1.3.1 255.255.255.0
Router(config-if)#exit
Router(config)#
Router(config)#int
Router(config)#interface loo
Router(config)#interface loopback 4

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback4, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback4, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 10.1.4.1 255.255.255.0
Router(config-if)#exit
Router(config)#inte
Router(config)#interface loo
Router(config)#interface loopback 5

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback5, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback5, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 10.1.5.1 255.255.255.0
Router(config-if)#exit
Router(config)#
Router(config)#int
Router(config)#interface loo
Router(config)#interface loopback 6

Router(config-if)#
%LINK-5-CHANGED: Interface Loopback6, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback6, changed state to up

Router(config-if)#ip ad
Router(config-if)#ip address 10.1.6.1 255.255.255.0
Router(config-if)#exit
Router(config)#router eigrp 100
Router(config-router)#do sh run
Building configuration...

Current configuration : 996 bytes
!
version 12.4
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface Loopback0
 ip address 10.1.0.1 255.255.255.0
!
interface Loopback1
 ip address 10.1.1.1 255.255.255.0
!
interface Loopback2
 ip address 10.1.2.1 255.255.255.0
!
interface Loopback3
 ip address 10.1.3.1 255.255.255.0
!
interface Loopback4
 ip address 10.1.4.1 255.255.255.0
!
interface Loopback5
 ip address 10.1.5.1 255.255.255.0
!
interface Loopback6
 ip address 10.1.6.1 255.255.255.0
!
interface FastEthernet0/0
 ip address 10.1.12.1 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
router eigrp 100
 auto-summary
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!
!
!
end
Router(config)#inte
Router(config)#interface fast
Router(config)#interface fastEthernet 0/1
Router(config-if)#ip add
Router(config-if)#ip address 10.0.6.7 255.255.255.0
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1
Router(config-if)#no sh
Router(config-if)#no shutdown 
Router(config-router)
Router(config-router)#no auto
Router(config-router)#netw
Router(config-router)#network 10.1.12.0 0.0.0.255
Router(config-router)#network 10.1.0.0 0.0.0.255
Router(config-router)#network 10.1.1.0 0.0.0.255
Router(config-router)#network 10.1.2.0 0.0.0.255
Router(config-router)#network 10.1.3.0 0.0.0.255
Router(config-router)#network 10.1.4.0 0.0.0.255
Router(config-router)#network 10.1.5.0 0.0.0.255
Router(config-router)#network 10.1.6.0 0.0.0.255
Router>enable
Router#show 
Router#show ip ei
Router#show ip eigrp nei
Router#show ip eigrp neighbors 
IP-EIGRP neighbors for process 100
H   Address         Interface      Hold Uptime    SRTT   RTO   Q   Seq
                                   (sec)          (ms)        Cnt  Num
0   10.1.12.2       Fa0/0          12   00:01:30  40     1000  0   15
Router>enable
Router#show
Router#show ip rou
Router#show ip route 
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 16 subnets, 2 masks
C       10.1.0.0/24 is directly connected, Loopback0
C       10.1.1.0/24 is directly connected, Loopback1
C       10.1.2.0/24 is directly connected, Loopback2
C       10.1.3.0/24 is directly connected, Loopback3
C       10.1.4.0/24 is directly connected, Loopback4
C       10.1.5.0/24 is directly connected, Loopback5
C       10.1.6.0/24 is directly connected, Loopback6
D EX    10.1.7.1/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
D EX    10.1.8.1/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
D EX    10.1.9.1/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
D EX    10.1.10.1/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
D EX    10.1.11.1/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
D EX    10.1.11.5/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
D EX    10.1.11.9/32 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0
C       10.1.12.0/24 is directly connected, FastEthernet0/0
D EX    10.1.23.0/24 [170/25628160] via 10.1.12.2, 00:00:55, FastEthernet0/0

Router>ena
Router>enable 
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#line ?
  <2-499>  First Line number
  aux      Auxiliary line
  console  Primary terminal line
  tty      Terminal controller
  vty      Virtual terminal
  x/y/z    Slot/Subslot/Port for Modems
Router(config)#line 
% Incomplete command.
Router(config)#line vty ?
  <0-15>  First Line number
Router(config)#line vty 15
Router(config-line)#pas
Router(config-line)#password ISTE123
Router(config-line)#exit
Router(config)#do show run
Building configuration...

Current configuration : 1292 bytes
!
version 12.4
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface Loopback0
 ip address 10.1.0.1 255.255.255.0
!
interface Loopback1
 ip address 10.1.1.1 255.255.255.0
!
interface Loopback2
 ip address 10.1.2.1 255.255.255.0
!
interface Loopback3
 ip address 10.1.3.1 255.255.255.0
!
interface Loopback4
 ip address 10.1.4.1 255.255.255.0
!
interface Loopback5
 ip address 10.1.5.1 255.255.255.0
!
interface Loopback6
 ip address 10.1.6.1 255.255.255.0
!
interface FastEthernet0/0
 ip address 10.1.12.1 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.0.6.7 255.255.255.0
 duplex auto
 speed auto
!
interface Vlan1
 no ip address
 shutdown
!
router eigrp 100
 network 10.1.12.0 0.0.0.255
 network 10.1.0.0 0.0.0.255
 network 10.1.1.0 0.0.0.255
 network 10.1.2.0 0.0.0.255
 network 10.1.3.0 0.0.0.255
 network 10.1.4.0 0.0.0.255
 network 10.1.5.0 0.0.0.255
 network 10.1.6.0 0.0.0.255
 no auto-summary
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
line vty 5 14
 login
line vty 15
 password ISTE123
 login
!
!
!
end


Router(config)#exit
Router#
Router#tel
Router#telnet 10.1.23.3
Trying 10.1.23.3 ...Open

[Connection to 10.1.23.3 closed by foreign host]
Router#
